# Datos del Titanic

In [4]:
import seaborn as sns #Paquete con datasets
import numpy as np
import pandas as pd

In [5]:
titanic = sns.load_dataset("titanic")

In [6]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.shape

(891, 15)

In [8]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [9]:
titanic['survived'] = pd.Categorical(titanic['survived'])
titanic['pclass'] = pd.Categorical(titanic['pclass'])
titanic['sex'] = pd.Categorical(titanic['sex'])

## Tablas e contingencia de una variable

In [10]:
tab = pd.crosstab(index = titanic['survived'],
                 columns = 'Pasajeros')
tab

col_0     Pasajeros
survived
0               549
1               342

In [11]:
type(tab)

pandas.core.frame.DataFrame

In [12]:
pd.crosstab(index = titanic['pclass'], columns = 'Pasajeros')

col_0   Pasajeros
pclass
1             216
2             184
3             491

In [13]:
tab_s = pd.crosstab(index = titanic['sex'], columns = 'Pasajeros')
tab_s

col_0   Pasajeros
sex
female        314
male          577

In [14]:
tab_s/tab_s.sum()

col_0   Pasajeros
sex
female   0.352413
male     0.647587

In [15]:
tab_c = pd.crosstab(index = titanic['deck'], columns = 'count')#deck = cubiertas del barco
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [16]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [17]:
titanic['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [18]:
np.sum(pd.isnull(titanic['deck']))

688

In [19]:
tab_c.sum()

col_0
count    203
dtype: int64

In [20]:
tab_c.shape

(7, 1)

In [21]:
tab_c.iloc[0:5]#Las tablas son como data frames

col_0  count
deck
A         15
B         47
C         59
D         33
E         32

In [22]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

## Tablas contingencia de dos variables

In [26]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'])
survived_sex.index = ['died', 'survived']#cambio de nombre para facilitar
survived_sex

sex       female  male
died          81   468
survived     233   109

In [ ]:
titanic.iloc[:,0]#otra notación para seleccionar todas las filas de una columna en concreto

In [54]:
survived_class = pd.crosstab(index = titanic.iloc[:,0],
                            columns = titanic['pclass'])
survived_class.index = ['Muerte', 'Vivo']
survived_class.columns = ['Primera', 'Segunda', 'Tercera']
survived_class

        Primera  Segunda  Tercera
Muerte       80       97      372
Vivo        136       87      119

In [58]:
survived_classv2 = pd.crosstab(index = titanic.iloc[:,0],
                               columns = titanic['pclass'], margins = True)
survived_classv2.index = ['Muerte', 'Vivo', 'Total clase']
survived_classv2.columns = ['Primera', 'Segunda', 'Tercera', 'Total superviv-muerte']
survived_classv2

             Primera  Segunda  Tercera  Total superviv-muerte
Muerte            80       97      372                    549
Vivo             136       87      119                    342
Total clase      216      184      491                    891

### Frecuencias relativas globales

In [63]:
survived_classv2/survived_classv2.iloc[2,3]

              Primera   Segunda   Tercera  Total superviv-muerte
Muerte       0.089787  0.108866  0.417508               0.616162
Vivo         0.152637  0.097643  0.133558               0.383838
Total clase  0.242424  0.206510  0.551066               1.000000

### Frecuencias relativas marginales

In [84]:
survived_classv2/survived_classv2.loc['Total clase']#Ratio supervivencia por clase

             Primera   Segunda   Tercera  Total superviv-muerte
Muerte       0.37037  0.527174  0.757637               0.616162
Vivo         0.62963  0.472826  0.242363               0.383838
Total clase  1.00000  1.000000  1.000000               1.000000

In [86]:
survived_classv2.div(survived_classv2.loc['Total clase'], axis = 1)

             Primera   Segunda   Tercera  Total superviv-muerte
Muerte       0.37037  0.527174  0.757637               0.616162
Vivo         0.62963  0.472826  0.242363               0.383838
Total clase  1.00000  1.000000  1.000000               1.000000

In [73]:
survived_classv2.T/survived_classv2['Total superviv-muerte']#Desglose de supervivencia por clase (.T = transpuesta)

                         Muerte      Vivo  Total clase
Primera                0.145719  0.397661     0.242424
Segunda                0.176685  0.254386     0.206510
Tercera                0.677596  0.347953     0.551066
Total superviv-muerte  1.000000  1.000000     1.000000

In [81]:
survived_classv2.div(survived_classv2['Total superviv-muerte'], axis = 0)# axis = 0 = división por filas
#Desglose de supervivencia por clase pero más elegante (sin .T)

              Primera   Segunda   Tercera  Total superviv-muerte
Muerte       0.145719  0.176685  0.677596                    1.0
Vivo         0.397661  0.254386  0.347953                    1.0
Total clase  0.242424  0.206510  0.551066                    1.0

In [80]:
survived_classv2['Total superviv-muerte']

Muerte         549
Vivo           342
Total clase    891
Name: Total superviv-muerte, dtype: int64

### Tablas multidimensionales

In [88]:
surv_sex_class = pd.crosstab(index = titanic['survived'],
                             columns = [titanic['sex'], titanic['pclass']],
                            margins = True)
surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [89]:
surv_sex_class['female']

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [91]:
surv_sex_class['female'][1]#Mujeres primera clase

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [95]:
surv_sex_class/surv_sex_class.loc['All']

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000